In [2]:
import pandas as pd

How to create a series object

In [4]:
s = pd.Series(["welcome", "to", "data 100"])
s

0     welcome
1          to
2    data 100
dtype: object

In [5]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [8]:
t = pd.Series([-1, 10, 2], index = ["a", "b", "c"])
t

a    -1
b    10
c     2
dtype: int64

In [9]:
t.values

array([-1, 10,  2])

In [10]:
t["a"]

-1

In [11]:
t[["a", "b"]]

a    -1
b    10
dtype: int64

In [12]:
even = (t%2 == 0)
even

a    False
b     True
c     True
dtype: bool

In [13]:
t[even]

b    10
c     2
dtype: int64

In [14]:
pd.DataFrame([1,2,3], columns = ["Numbers"])

   Numbers
0        1
1        2
2        3

In [15]:
pd.DataFrame([[1, "one"], [2, "two"], [3, "three"]], columns = ["Number", "Desc"])

   Number   Desc
0       1    one
1       2    two
2       3  three

In [16]:
pd.DataFrame({"fruit": ["Strawberry", "Orange"], "Price": [5, 10]})

        fruit  Price
0  Strawberry      5
1      Orange     10

In [19]:
s_a = pd.Series([1, 2, 3], index = [4, 5, 6])
s_b = pd.Series([2, 3, 4], index = [5, 6, 7])

sC = pd.DataFrame({"A" : s_a, "B": s_b})
sC

     A    B
4  1.0  NaN
5  2.0  2.0
6  3.0  3.0
7  NaN  4.0

In [20]:
sC.shape

(4, 2)

In [22]:
sC.columns

Index(['A', 'B'], dtype='object')

In [23]:
df = pd.DataFrame({"c1": [1,2,3,4], "c2": [2,4,6,8]})
df

   c1  c2
0   1   2
1   2   4
2   3   6
3   4   8

In [25]:
df.head(2)

   c1  c2
0   1   2
1   2   4

In [26]:
df.tail(2)

   c1  c2
2   3   6
3   4   8